
//TW=Twitter
//YT=YouTube
var JPvoiceList = [
    'JP_TW_20200512_001=十八まあああん到達しましたあああ.m4a',
    'JP_TW_20200512_002=ありがとぅ！.m4a',
    'JP_YT_20191206_002=お前らキモオタクかよ.m4a',
    'JP_YT_20191206_001=まじキモイなんだけど.......m4a',
    'JP_YT_20191206_003=あなた今年何歳ですか.......m4a',
    'JP_YT_20191206_004=ありがとう感謝です.m4a',
    'JP_YT_20191206_005=困ったえへへ.m4a',
    'JP_YT_20191206_006=ごめんね.m4a',
    'JP_YT_20191206_007=おつミルでしたーバイバイ.m4a',
    'JP_YT_20191206_008=バイバイ(小声).m4a',
    'JP_YT_20190701_001=こんばんミルミル～.m4a',
    'JP_YT_20190701_002=えっちょっと待ってよ.......m4a',
    'JP_YT_20190701_003=じゃあ行きますよ.m4a',
    'JP_YT_20190701_004=ふあ！いぇいい！やった！.m4a',
    'JP_YT_20190701_005=フルコンボだ！.m4a',
    'JP_YT_20190701_006=あこれパソボっ.......m4a',
    'JP_YT_20190701_007=これっこれっこれほしぃぃ.m4a',
    'JP_YT_20190306_001=おはミルミル～こんちゃんミルミル～.m4a',
    'JP_YT_20190306_002=杏仁ミルミル～だよー.m4a',
    'JP_YT_20190306_003=ざっつ！ざっつ！雑すぎるー.m4a',
    'JP_YT_20190306_004=初見じゃないじゃん！初見じゃないんじゃん！.m4a',
    'JP_YT_20190306_005=これ、読めないな.m4a',
    'JP_YT_20190306_006=ちゃんと休むだよ(小声).m4a',
    'JP_YT_20190306_007=お昼ねんねしよう.m4a',
    'JP_YT_20190306_008=女の子だったら誰でもいいんだよ.m4a',
    'JP_YT_20190306_009=モフモフしたいです クンカクンカしたいです.m4a',
    'JP_YT_20190306_010=褒められた！.m4a',
    'JP_YT_20190306_011=ポンコツでごめんなさい.m4a',
    'JP_YT_20190306_012=こんにちミルミル～.m4a',
    'JP_YT_20190306_013=行ってミルミル.m4a',
    'JP_YT_20190306_014=マジマジおすすめだからね！マジ行ってくださいな！.m4a',
    'JP_YT_20190306_015=おはミルミル こんちゃんミルミル…….m4a',
    'JP_YT_20190306_016=ごめんって.m4a',
    'JP_YT_20190306_017=ミル明日大阪行くねん.m4a',
    'JP_YT_20190306_018=バーチャル世界では体重何でないから…….m4a',
    'JP_YT_20190306_019=ミルだったらね もう寂しくて死んじゃうウサギかな.m4a',
    'JP_YT_20190306_020=I am very 早起き OK？.m4a',
    'JP_YT_20190306_021=お～マジやばくない？.m4a',
    'JP_YT_20190306_022=マジやばくない？ それマジやばくない？.m4a',
    'JP_YT_20190306_023=わかる！わかる！…….m4a',
    'JP_YT_20190306_024=ミルマジヤバい可愛いわかる卍.m4a',
    'JP_YT_20190306_025=66666666.m4a',
    'JP_YT_20190306_026=77777777777.m4a',
    'JP_YT_20190306_027=なんで なんでだろう.m4a',
    'JP_YT_20190306_028=パクチ パクチ パクチパンチ.m4a',
    'JP_YT_20190306_029=嫌だ.m4a',
    'JP_YT_20190306_030=お姉ちゃんじゃない みんなの…….m4a',

]

var CNvoiceList = [
    'CN_TW_20200523_001=起床囉～.m4a',
    'CN_YT_20191206_001=工具人通常都是被記在心裡.......m4a',
    'CN_YT_20191206_002=ミル相信信眾們都是純潔又可愛的.......m4a',
    'CN_YT_20191206_003=帕美魯克拉魯克啦哩摟哩波噴.m4a',
    'CN_YT_20191206_004=孩子阿你在幹麻.m4a',
    'CN_YT_20191206_005=ミル一個人一個晚上可以.......m4a',
    'CN_YT_20191206_006=喜歡吃的東西是.......m4a',
    'CN_YT_20191206_007=喔天哪不行嘔噁噁噁.m4a',
    'CN_YT_20191206_008=ミル是一個很愛吃薯條的.......m4a',
    'CN_YT_20191206_009=好想吃現炸薯條喔～.m4a',
    'CN_YT_20191206_010=美味！極致的美味！太美味啦.m4a',
    'CN_YT_20191206_011=喝水對身體健康非常好.m4a',
    'CN_YT_20191206_012=然後啉酒然後唱歌.m4a',
    'CN_YT_20191206_013=啉酒唱歌喝酒唱歌然後晚上.......m4a',
    'CN_YT_20191206_014=休息是為了走更長遠的路嘛對不對.m4a',
    'CN_YT_20191206_015=愛大家嗯嘛.m4a',
    'CN_YT_20190701_001=安安~安安~.m4a',
    'CN_YT_20190701_002=要友善喔~要尊重包容友善喔~.m4a',
    'CN_YT_20190701_003=666666.m4a',
    'CN_YT_20190701_004=加油↑.m4a',
    'CN_YT_20190701_005=等一下等一下www啊哈哈ww.m4a',
    'CN_YT_20190701_006=玩音樂遊戲的時候R.......m4a',
    'CN_YT_20190701_007=喝啊！單身狗的手速！.m4a',
    'CN_YT_20190701_008=瘋狂的...RRR.m4a',
    'CN_YT_20190701_009=ㄋㄟㄋㄟ好大喔！.m4a',
    'CN_YT_20190306_001=ㄇㄉㄈㄎ.m4a',
    'CN_YT_20190306_002=我毋知.m4a',
    'CN_YT_20190306_003=阿~我是一個懶惰鬼.m4a',
    'CN_YT_20190306_004=知識型Vtuber杏仁ミル.m4a',
    'CN_YT_20190306_005=氣噗噗 咘~.m4a',
    'CN_YT_20190306_006=感冒用斯斯…….m4a',
]

var ORvoiceList = [
    'OR_YT_20191206_001=RA~RA~RA~.m4a',
    'OR_YT_20190701_005=NICE.m4a',
    'OR_YT_20190306_003=I wake up at 8 am.m4a',
    'OR_YT_20190306_004=I wake up very very hungry.......m4a',
    'OR_YT_20190306_005=Yes you know I know yay good good.m4a',
    'OR_YT_20190306_007=WOW WOW WOW.m4a',
    'OR_YT_20190306_010=Who care who care.m4a',
    'OR_YT_20190306_012=Mi crowave.m4a',
    'OR_YT_20190701_001=(可愛い声001).m4a',
    'OR_YT_20191206_003=(可愛い声002).m4a',
    'OR_YT_20190701_002=(喜びの声001).m4a',
    'OR_YT_20190701_003=(驚きの声001).m4a',
    'OR_YT_20190701_007=(驚きの声002).m4a',
    'OR_YT_20190701_009=(驚きの声003).m4a',
    'OR_YT_20190306_006=(驚きの声004).m4a',
    'OR_YT_20190701_008=(悔しい声001).m4a',
    'OR_YT_20191206_002=(奇声001).m4a',
    'OR_YT_20190701_006=(奇声002).m4a',
    'OR_YT_20190306_002=(雄叫び001).m4a',
    'OR_YT_20191206_004=(笑い声001).m4a',
    'OR_YT_20190701_004=(笑い声002).m4a',
    'OR_YT_20190306_001=(笑い声003).m4a',
    'OR_YT_20190306_008=(笑い声004).m4a',
    'OR_YT_20190306_009=(笑い声005).m4a',
    'OR_YT_20190306_011=(笑い声006).m4a',
    'OR_YT_20190306_013=(笑い声007).m4a',


]

const func = new Vue({
    el: '#Base',
    data: {
        JPvoiceList: JPvoiceList,
        CNvoiceList: CNvoiceList,
        ORvoiceList: ORvoiceList
    },

    computed: {
        getJPVoiceItem: function () {
            return this.JPvoiceList
        },

        getCNVoiceItem: function () {
            return this.CNvoiceList
        },

        getORVoiceItem: function () {
            return this.ORvoiceList
        }

    },

    methods: {
        playSound: function (voice) {
            const audio = new Howl({
                src: './voice/' + voice,
                volume: 1.9
            })
            audio.play()
        },
    }


})
